<?xml version="1.0" ?>
<net name="yolov3-tiny" version="11">
	<layers>
		<layer id="0" name="image_input" type="Parameter" version="opset1">
			<data element_type="f32" shape="?,?,?,3"/>
			<rt_info>
				<attribute name="fused_names" value="image_input" version="0"/>
				<attribute name="old_api_map_order" value="0, 2, 3, 1" version="0"/>
			</rt_info>
			<output>
				<port id="0" names="image_input:0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="image_input/Transpose([0 3 1 2])/value31354711" type="Const" version="opset1">
			<data element_type="i64" offset="0" shape="4" size="32"/>
			<rt_info>
				<attribute name="fused_names" value="image_input/Transpose([0 3 1 2])/value31354711" version="0"/>
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="image_input/Transpose([0 3 1 2])" type="Transpose" version="opset1">
			<rt_info>
				<attribute name="fused_names" value="image_input/Transpose([0 3 1 2])" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>3</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>3</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="batch_normalization/FusedBatchNormV3/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" offset="32" shape="16, 3, 3, 3" size="1728"/>
			<rt_info>
				<attribute name="fused_names" value="batch_normalization/FusedBatchNormV3/mean/Fused_Mul__copy" version="0"/>
			</rt_info>
			<output>
				<port id="0" names="conv2d/Conv2D/ReadVariableOp:0" precision="FP32">
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="conv2d/Conv2D" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<rt_info>
				<attribute name="fused_names" value="conv2d/Conv2D" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>3</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="data_add_2386" type="Const" version="opset1">
			<data element_type="f32" offset="1760" shape="1, 16, 1, 1" size="64"/>
			<rt_info>
				<attribute name="fused_names" value="data_add_2386" version="0"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="batch_normalization/FusedBatchNormV3/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" value="batch_normalization/FusedBatchNormV3/variance/Fused_Add_" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="batch_normalization/FusedBatchNormV3:0" precision="FP32">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="leaky_re_lu/LeakyRelu/weights33604696" type="Const" version="opset1">
			<data element_type="f32" offset="1824" shape="1" size="4"/>
			<rt_info>
				<attribute name="fused_names" value="leaky_re_lu/LeakyRelu/weights33604696" version="0"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="leaky_re_lu/LeakyRelu" type="PReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" value="leaky_re_lu/LeakyRelu" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="leaky_re_lu/LeakyRelu:0" precision="FP32">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="max_pooling2d/MaxPool" type="MaxPool" version="opset8">
			<data auto_pad="same_upper" axis="0" dilations="1, 1" index_element_type="i64" kernel="2, 2" pads_begin="0, 0" pads_end="0, 0" rounding_type="floor" strides="2, 2"/>
			<rt_info>
				<attribute name="fused_names" value="max_pooling2d/MaxPool" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" names="max_pooling2d/MaxPool:0" precision="FP32">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="batch_normalization_1/FusedBatchNormV3/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" offset="1828" shape="32, 16, 3, 3" size="18432"/>
			<rt_info>
				<attribute name="fused_names" value="batch_normalization_1/FusedBatchNormV3/mean/Fused_Mul__copy" version="0"/>
			</rt_info>
			<output>
				<port id="0" names="conv2d_1/Conv2D/ReadVariableOp:0" precision="FP32">
					<dim>32</dim>
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="conv2d_1/Conv2D" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<rt_info>
				<attribute name="fused_names" value="conv2d_1/Conv2D" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="data_add_23892394" type="Const" version="opset1">
			<data element_type="f32" offset="20260" shape="1, 32, 1, 1" size="128"/>
			<rt_info>
				<attribute name="fused_names" value="data_add_23892394" version="0"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="batch_normalization_1/FusedBatchNormV3/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" value="batch_normalization_1/FusedBatchNormV3/variance/Fused_Add_" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="batch_normalization_1/FusedBatchNormV3:0" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="leaky_re_lu_1/LeakyRelu/weights33524636" type="Const" version="opset1">
			<data element_type="f32" offset="1824" shape="1" size="4"/>
			<rt_info>
				<attribute name="fused_names" value="leaky_re_lu_1/LeakyRelu/weights33524636" version="0"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="leaky_re_lu_1/LeakyRelu" type="PReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" value="leaky_re_lu_1/LeakyRelu" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="leaky_re_lu_1/LeakyRelu:0" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="max_pooling2d_1/MaxPool" type="MaxPool" version="opset8">
			<data auto_pad="same_upper" axis="0" dilations="1, 1" index_element_type="i64" kernel="2, 2" pads_begin="0, 0" pads_end="0, 0" rounding_type="floor" strides="2, 2"/>
			<rt_info>
				<attribute name="fused_names" value="max_pooling2d_1/MaxPool" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" names="max_pooling2d_1/MaxPool:0" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="batch_normalization_2/FusedBatchNormV3/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" offset="20388" shape="64, 32, 3, 3" size="73728"/>
			<rt_info>
				<attribute name="fused_names" value="batch_normalization_2/FusedBatchNormV3/mean/Fused_Mul__copy" version="0"/>
			</rt_info>
			<output>
				<port id="0" names="conv2d_2/Conv2D/ReadVariableOp:0" precision="FP32">
					<dim>64</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="conv2d_2/Conv2D" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<rt_info>
				<attribute name="fused_names" value="conv2d_2/Conv2D" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>64</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="data_add_23972402" type="Const" version="opset1">
			<data element_type="f32" offset="94116" shape="1, 64, 1, 1" size="256"/>
			<rt_info>
				<attribute name="fused_names" value="data_add_23972402" version="0"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="batch_normalization_2/FusedBatchNormV3/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" value="batch_normalization_2/FusedBatchNormV3/variance/Fused_Add_" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>64</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="batch_normalization_2/FusedBatchNormV3:0" precision="FP32">
					<dim>-1</dim>
					<dim>64</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="leaky_re_lu_2/LeakyRelu/weights33364714" type="Const" version="opset1">
			<data element_type="f32" offset="1824" shape="1" size="4"/>
			<rt_info>
				<attribute name="fused_names" value="leaky_re_lu_2/LeakyRelu/weights33364714" version="0"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="leaky_re_lu_2/LeakyRelu" type="PReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" value="leaky_re_lu_2/LeakyRelu" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>64</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="leaky_re_lu_2/LeakyRelu:0" precision="FP32">
					<dim>-1</dim>
					<dim>64</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="max_pooling2d_2/MaxPool" type="MaxPool" version="opset8">
			<data auto_pad="same_upper" axis="0" dilations="1, 1" index_element_type="i64" kernel="2, 2" pads_begin="0, 0" pads_end="0, 0" rounding_type="floor" strides="2, 2"/>
			<rt_info>
				<attribute name="fused_names" value="max_pooling2d_2/MaxPool" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>64</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" names="max_pooling2d_2/MaxPool:0" precision="FP32">
					<dim>-1</dim>
					<dim>64</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>-1</dim>
					<dim>64</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="batch_normalization_3/FusedBatchNormV3/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" offset="94372" shape="128, 64, 3, 3" size="294912"/>
			<rt_info>
				<attribute name="fused_names" value="batch_normalization_3/FusedBatchNormV3/mean/Fused_Mul__copy" version="0"/>
			</rt_info>
			<output>
				<port id="0" names="conv2d_3/Conv2D/ReadVariableOp:0" precision="FP32">
					<dim>128</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="conv2d_3/Conv2D" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<rt_info>
				<attribute name="fused_names" value="conv2d_3/Conv2D" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>64</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>128</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="data_add_24052410" type="Const" version="opset1">
			<data element_type="f32" offset="389284" shape="1, 128, 1, 1" size="512"/>
			<rt_info>
				<attribute name="fused_names" value="data_add_24052410" version="0"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="batch_normalization_3/FusedBatchNormV3/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" value="batch_normalization_3/FusedBatchNormV3/variance/Fused_Add_" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>128</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="batch_normalization_3/FusedBatchNormV3:0" precision="FP32">
					<dim>-1</dim>
					<dim>128</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="leaky_re_lu_3/LeakyRelu/weights33404669" type="Const" version="opset1">
			<data element_type="f32" offset="1824" shape="1" size="4"/>
			<rt_info>
				<attribute name="fused_names" value="leaky_re_lu_3/LeakyRelu/weights33404669" version="0"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="leaky_re_lu_3/LeakyRelu" type="PReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" value="leaky_re_lu_3/LeakyRelu" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>128</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="leaky_re_lu_3/LeakyRelu:0" precision="FP32">
					<dim>-1</dim>
					<dim>128</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="max_pooling2d_3/MaxPool" type="MaxPool" version="opset8">
			<data auto_pad="same_upper" axis="0" dilations="1, 1" index_element_type="i64" kernel="2, 2" pads_begin="0, 0" pads_end="0, 0" rounding_type="floor" strides="2, 2"/>
			<rt_info>
				<attribute name="fused_names" value="max_pooling2d_3/MaxPool" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>128</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" names="max_pooling2d_3/MaxPool:0" precision="FP32">
					<dim>-1</dim>
					<dim>128</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>-1</dim>
					<dim>128</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="batch_normalization_4/FusedBatchNormV3/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" offset="389796" shape="256, 128, 3, 3" size="1179648"/>
			<rt_info>
				<attribute name="fused_names" value="batch_normalization_4/FusedBatchNormV3/mean/Fused_Mul__copy" version="0"/>
			</rt_info>
			<output>
				<port id="0" names="conv2d_4/Conv2D/ReadVariableOp:0" precision="FP32">
					<dim>256</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="conv2d_4/Conv2D" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<rt_info>
				<attribute name="fused_names" value="conv2d_4/Conv2D" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>128</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>256</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>256</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="data_add_24132418" type="Const" version="opset1">
			<data element_type="f32" offset="1569444" shape="1, 256, 1, 1" size="1024"/>
			<rt_info>
				<attribute name="fused_names" value="data_add_24132418" version="0"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="batch_normalization_4/FusedBatchNormV3/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" value="batch_normalization_4/FusedBatchNormV3/variance/Fused_Add_" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>256</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="batch_normalization_4/FusedBatchNormV3:0" precision="FP32">
					<dim>-1</dim>
					<dim>256</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="leaky_re_lu_4/LeakyRelu/weights33324723" type="Const" version="opset1">
			<data element_type="f32" offset="1824" shape="1" size="4"/>
			<rt_info>
				<attribute name="fused_names" value="leaky_re_lu_4/LeakyRelu/weights33324723" version="0"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="leaky_re_lu_4/LeakyRelu" type="PReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" value="leaky_re_lu_4/LeakyRelu" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>256</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="leaky_re_lu_4/LeakyRelu:0" precision="FP32">
					<dim>-1</dim>
					<dim>256</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="max_pooling2d_4/MaxPool" type="MaxPool" version="opset8">
			<data auto_pad="same_upper" axis="0" dilations="1, 1" index_element_type="i64" kernel="2, 2" pads_begin="0, 0" pads_end="0, 0" rounding_type="floor" strides="2, 2"/>
			<rt_info>
				<attribute name="fused_names" value="max_pooling2d_4/MaxPool" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>256</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" names="max_pooling2d_4/MaxPool:0" precision="FP32">
					<dim>-1</dim>
					<dim>256</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>-1</dim>
					<dim>256</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="batch_normalization_5/FusedBatchNormV3/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" offset="1570468" shape="512, 256, 3, 3" size="4718592"/>
			<rt_info>
				<attribute name="fused_names" value="batch_normalization_5/FusedBatchNormV3/mean/Fused_Mul__copy" version="0"/>
			</rt_info>
			<output>
				<port id="0" names="conv2d_5/Conv2D/ReadVariableOp:0" precision="FP32">
					<dim>512</dim>
					<dim>256</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="conv2d_5/Conv2D" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<rt_info>
				<attribute name="fused_names" value="conv2d_5/Conv2D" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>256</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>512</dim>
					<dim>256</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>512</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="data_add_24212426" type="Const" version="opset1">
			<data element_type="f32" offset="6289060" shape="1, 512, 1, 1" size="2048"/>
			<rt_info>
				<attribute name="fused_names" value="data_add_24212426" version="0"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="batch_normalization_5/FusedBatchNormV3/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" value="batch_normalization_5/FusedBatchNormV3/variance/Fused_Add_" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>512</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="batch_normalization_5/FusedBatchNormV3:0" precision="FP32">
					<dim>-1</dim>
					<dim>512</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="leaky_re_lu_5/LeakyRelu/weights33564663" type="Const" version="opset1">
			<data element_type="f32" offset="1824" shape="1" size="4"/>
			<rt_info>
				<attribute name="fused_names" value="leaky_re_lu_5/LeakyRelu/weights33564663" version="0"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="leaky_re_lu_5/LeakyRelu" type="PReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" value="leaky_re_lu_5/LeakyRelu" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>512</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="leaky_re_lu_5/LeakyRelu:0" precision="FP32">
					<dim>-1</dim>
					<dim>512</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="max_pooling2d_5/MaxPool" type="MaxPool" version="opset8">
			<data auto_pad="same_upper" axis="0" dilations="1, 1" index_element_type="i64" kernel="2, 2" pads_begin="0, 0" pads_end="0, 0" rounding_type="floor" strides="1, 1"/>
			<rt_info>
				<attribute name="fused_names" value="max_pooling2d_5/MaxPool" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>512</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" names="max_pooling2d_5/MaxPool:0" precision="FP32">
					<dim>-1</dim>
					<dim>512</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>-1</dim>
					<dim>512</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="batch_normalization_6/FusedBatchNormV3/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" offset="6291108" shape="1024, 512, 3, 3" size="18874368"/>
			<rt_info>
				<attribute name="fused_names" value="batch_normalization_6/FusedBatchNormV3/mean/Fused_Mul__copy" version="0"/>
			</rt_info>
			<output>
				<port id="0" names="conv2d_6/Conv2D/ReadVariableOp:0" precision="FP32">
					<dim>1024</dim>
					<dim>512</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="conv2d_6/Conv2D" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<rt_info>
				<attribute name="fused_names" value="conv2d_6/Conv2D" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>512</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1024</dim>
					<dim>512</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>1024</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="data_add_24292434" type="Const" version="opset1">
			<data element_type="f32" offset="25165476" shape="1, 1024, 1, 1" size="4096"/>
			<rt_info>
				<attribute name="fused_names" value="data_add_24292434" version="0"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="batch_normalization_6/FusedBatchNormV3/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" value="batch_normalization_6/FusedBatchNormV3/variance/Fused_Add_" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>1024</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="batch_normalization_6/FusedBatchNormV3:0" precision="FP32">
					<dim>-1</dim>
					<dim>1024</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="leaky_re_lu_6/LeakyRelu/weights33644675" type="Const" version="opset1">
			<data element_type="f32" offset="1824" shape="1" size="4"/>
			<rt_info>
				<attribute name="fused_names" value="leaky_re_lu_6/LeakyRelu/weights33644675" version="0"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="leaky_re_lu_6/LeakyRelu" type="PReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" value="leaky_re_lu_6/LeakyRelu" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>1024</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="leaky_re_lu_6/LeakyRelu:0" precision="FP32">
					<dim>-1</dim>
					<dim>1024</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="batch_normalization_7/FusedBatchNormV3/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" offset="25169572" shape="256, 1024, 1, 1" size="1048576"/>
			<rt_info>
				<attribute name="fused_names" value="batch_normalization_7/FusedBatchNormV3/mean/Fused_Mul__copy" version="0"/>
			</rt_info>
			<output>
				<port id="0" names="conv2d_7/Conv2D/ReadVariableOp:0" precision="FP32">
					<dim>256</dim>
					<dim>1024</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="conv2d_7/Conv2D" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<rt_info>
				<attribute name="fused_names" value="conv2d_7/Conv2D" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>1024</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>256</dim>
					<dim>1024</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>256</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="data_add_24372442" type="Const" version="opset1">
			<data element_type="f32" offset="26218148" shape="1, 256, 1, 1" size="1024"/>
			<rt_info>
				<attribute name="fused_names" value="data_add_24372442" version="0"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="batch_normalization_7/FusedBatchNormV3/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" value="batch_normalization_7/FusedBatchNormV3/variance/Fused_Add_" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>256</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="batch_normalization_7/FusedBatchNormV3:0" precision="FP32">
					<dim>-1</dim>
					<dim>256</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="leaky_re_lu_7/LeakyRelu/weights33284651" type="Const" version="opset1">
			<data element_type="f32" offset="1824" shape="1" size="4"/>
			<rt_info>
				<attribute name="fused_names" value="leaky_re_lu_7/LeakyRelu/weights33284651" version="0"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="leaky_re_lu_7/LeakyRelu" type="PReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" value="leaky_re_lu_7/LeakyRelu" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>256</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="leaky_re_lu_7/LeakyRelu:0" precision="FP32">
					<dim>-1</dim>
					<dim>256</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="batch_normalization_8/FusedBatchNormV3/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" offset="26219172" shape="512, 256, 3, 3" size="4718592"/>
			<rt_info>
				<attribute name="fused_names" value="batch_normalization_8/FusedBatchNormV3/mean/Fused_Mul__copy" version="0"/>
			</rt_info>
			<output>
				<port id="0" names="conv2d_8/Conv2D/ReadVariableOp:0" precision="FP32">
					<dim>512</dim>
					<dim>256</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="conv2d_8/Conv2D" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<rt_info>
				<attribute name="fused_names" value="conv2d_8/Conv2D" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>256</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>512</dim>
					<dim>256</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>512</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="data_add_24452450" type="Const" version="opset1">
			<data element_type="f32" offset="30937764" shape="1, 512, 1, 1" size="2048"/>
			<rt_info>
				<attribute name="fused_names" value="data_add_24452450" version="0"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="batch_normalization_8/FusedBatchNormV3/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" value="batch_normalization_8/FusedBatchNormV3/variance/Fused_Add_" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>512</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="batch_normalization_8/FusedBatchNormV3:0" precision="FP32">
					<dim>-1</dim>
					<dim>512</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="leaky_re_lu_8/LeakyRelu/weights33484660" type="Const" version="opset1">
			<data element_type="f32" offset="1824" shape="1" size="4"/>
			<rt_info>
				<attribute name="fused_names" value="leaky_re_lu_8/LeakyRelu/weights33484660" version="0"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="leaky_re_lu_8/LeakyRelu" type="PReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" value="leaky_re_lu_8/LeakyRelu" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>512</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="leaky_re_lu_8/LeakyRelu:0" precision="FP32">
					<dim>-1</dim>
					<dim>512</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="conv2d_9/Conv2D/ReadVariableOp" type="Const" version="opset1">
			<data element_type="f32" offset="30939812" shape="255, 512, 1, 1" size="522240"/>
			<rt_info>
				<attribute name="fused_names" value="conv2d_9/Conv2D/ReadVariableOp" version="0"/>
			</rt_info>
			<output>
				<port id="0" names="conv2d_9/Conv2D/ReadVariableOp:0" precision="FP32">
					<dim>255</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="conv2d_9/Conv2D" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<rt_info>
				<attribute name="fused_names" value="conv2d_9/Conv2D" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>512</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>255</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="conv2d_9/Conv2D:0" precision="FP32">
					<dim>-1</dim>
					<dim>255</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="conv2d_9/BiasAdd/ReadVariableOp" type="Const" version="opset1">
			<data element_type="f32" offset="31462052" shape="1, 255, 1, 1" size="1020"/>
			<rt_info>
				<attribute name="fused_names" value="conv2d_9/BiasAdd/ReadVariableOp" version="0"/>
			</rt_info>
			<output>
				<port id="0" names="conv2d_9/BiasAdd/ReadVariableOp:0" precision="FP32">
					<dim>1</dim>
					<dim>255</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="conv2d_9/BiasAdd/Add/prev" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" value="conv2d_9/BiasAdd/Add/prev" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>255</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>255</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>255</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="3137/value31394630" type="Const" version="opset1">
			<data element_type="i64" offset="31463072" shape="4" size="32"/>
			<rt_info>
				<attribute name="fused_names" value="3137/value31394630" version="0"/>
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="conv2d_9/BiasAdd/Add" type="Transpose" version="opset1">
			<rt_info>
				<attribute name="fused_names" value="conv2d_9/BiasAdd/Add" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>255</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" names="conv2d_9/BiasAdd:0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>255</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="batch_normalization_9/FusedBatchNormV3/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" offset="31463104" shape="128, 256, 1, 1" size="131072"/>
			<rt_info>
				<attribute name="fused_names" value="batch_normalization_9/FusedBatchNormV3/mean/Fused_Mul__copy" version="0"/>
			</rt_info>
			<output>
				<port id="0" names="conv2d_10/Conv2D/ReadVariableOp:0" precision="FP32">
					<dim>128</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="conv2d_10/Conv2D" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<rt_info>
				<attribute name="fused_names" value="conv2d_10/Conv2D" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>256</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>128</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="data_add_24532458" type="Const" version="opset1">
			<data element_type="f32" offset="31594176" shape="1, 128, 1, 1" size="512"/>
			<rt_info>
				<attribute name="fused_names" value="data_add_24532458" version="0"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="batch_normalization_9/FusedBatchNormV3/variance/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" value="batch_normalization_9/FusedBatchNormV3/variance/Fused_Add_" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>128</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="batch_normalization_9/FusedBatchNormV3:0" precision="FP32">
					<dim>-1</dim>
					<dim>128</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="leaky_re_lu_9/LeakyRelu/weights33444648" type="Const" version="opset1">
			<data element_type="f32" offset="1824" shape="1" size="4"/>
			<rt_info>
				<attribute name="fused_names" value="leaky_re_lu_9/LeakyRelu/weights33444648" version="0"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="leaky_re_lu_9/LeakyRelu" type="PReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" value="leaky_re_lu_9/LeakyRelu" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>128</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="leaky_re_lu_9/LeakyRelu:0" precision="FP32">
					<dim>-1</dim>
					<dim>128</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="up_sampling2d/Shape" type="ShapeOf" version="opset3">
			<data output_type="i32"/>
			<rt_info>
				<attribute name="fused_names" value="up_sampling2d/Shape" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>128</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I32">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="up_sampling2d/Shape/GatherNCHWtoNHWC_input_port_1/value30854576" type="Const" version="opset1">
			<data element_type="i32" offset="31594688" shape="4" size="16"/>
			<rt_info>
				<attribute name="fused_names" value="up_sampling2d/Shape/GatherNCHWtoNHWC_input_port_1/value30854576" version="0"/>
			</rt_info>
			<output>
				<port id="0" precision="I32">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="up_sampling2d/Shape/GatherNCHWtoNHWC_input_port_2/value30874657" type="Const" version="opset1">
			<data element_type="i64" offset="31594704" shape="" size="8"/>
			<rt_info>
				<attribute name="fused_names" value="up_sampling2d/Shape/GatherNCHWtoNHWC_input_port_2/value30874657" version="0"/>
			</rt_info>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="79" name="up_sampling2d/Shape/GatherNCHWtoNHWC" type="Gather" version="opset8">
			<data batch_dims="0"/>
			<rt_info>
				<attribute name="fused_names" value="up_sampling2d/Shape/GatherNCHWtoNHWC, up_sampling2d/Shape/GatherNCHWtoNHWC_input_port_1/value30854576, up_sampling2d/Shape/GatherNCHWtoNHWC_input_port_2/value30874657" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="I32">
					<dim>4</dim>
				</port>
				<port id="1" precision="I32">
					<dim>4</dim>
				</port>
				<port id="2" precision="I64"/>
			</input>
			<output>
				<port id="3" names="up_sampling2d/Shape:0" precision="I32">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="up_sampling2d/strided_slice/stack" type="Const" version="opset1">
			<data element_type="i64" offset="31594712" shape="1" size="8"/>
			<rt_info>
				<attribute name="fused_names" value="up_sampling2d/strided_slice/stack" version="0"/>
			</rt_info>
			<output>
				<port id="0" names="up_sampling2d/strided_slice/stack:0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="up_sampling2d/strided_slice/stack_1" type="Const" version="opset1">
			<data element_type="i64" offset="31594720" shape="1" size="8"/>
			<rt_info>
				<attribute name="fused_names" value="up_sampling2d/strided_slice/stack_1" version="0"/>
			</rt_info>
			<output>
				<port id="0" names="up_sampling2d/strided_slice/stack_1:0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="up_sampling2d/strided_slice/stack_2" type="Const" version="opset1">
			<data element_type="i64" offset="31594712" shape="1" size="8"/>
			<rt_info>
				<attribute name="fused_names" value="up_sampling2d/strided_slice/stack_2" version="0"/>
			</rt_info>
			<output>
				<port id="0" names="up_sampling2d/strided_slice/stack_2:0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="up_sampling2d/strided_slice" type="StridedSlice" version="opset1">
			<data begin_mask="0" ellipsis_mask="0" end_mask="0" new_axis_mask="0" shrink_axis_mask="0"/>
			<rt_info>
				<attribute name="fused_names" value="up_sampling2d/strided_slice, up_sampling2d/strided_slice/stack, up_sampling2d/strided_slice/stack_1, up_sampling2d/strided_slice/stack_2" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="I32">
					<dim>4</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="4" names="up_sampling2d/strided_slice:0" precision="I32">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="up_sampling2d/Const" type="Const" version="opset1">
			<data element_type="i32" offset="31594728" shape="2" size="8"/>
			<rt_info>
				<attribute name="fused_names" value="up_sampling2d/Const" version="0"/>
			</rt_info>
			<output>
				<port id="0" names="up_sampling2d/Const:0" precision="I32">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="up_sampling2d/mul" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" value="up_sampling2d/Const, up_sampling2d/mul" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="I32">
					<dim>2</dim>
				</port>
				<port id="1" precision="I32">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I32">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="up_sampling2d/resize/ResizeNearestNeighbor/Cast_1" type="Convert" version="opset1">
			<data destination_type="i64"/>
			<rt_info>
				<attribute name="fused_names" value="up_sampling2d/resize/ResizeNearestNeighbor/Cast_1" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="I32">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="1" names="up_sampling2d/mul:0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="184" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="fused_names" value="184" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="I32">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="up_sampling2d/resize/ResizeNearestNeighbor/shapeof" type="ShapeOf" version="opset3">
			<data output_type="i64"/>
			<rt_info>
				<attribute name="fused_names" value="up_sampling2d/resize/ResizeNearestNeighbor/shapeof" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>128</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
